{
    "VisualPipeline": {
        "step_list": {
            "tool1D1388756427315": {
                "id": "tool1D1388756427315",
                "toolid": "tool1",
                "name": "Tool 1",
                "type": "app",
                "params": {
                    "param1": "basic",
                    "param2": "First"
                },
                "layout": {
                    "x": 149,
                    "y": 98
                }
            },
            "tool3D1388756430435": {
                "id": "tool3D1388756430435",
                "toolid": "tool3",
                "name": "Tool 3",
                "type": "app",
                "params": {
                    "param1": "Hard",
                    "param2": "second"
                },
                "layout": {
                    "x": 141,
                    "y": 250
                }
            },
            "tool2D1388756434803": {
                "id": "tool2D1388756434803",
                "toolid": "tool2",
                "name": "Tool 2",
                "type": "app",
                "params": {},
                "layout": {
                    "x": 410,
                    "y": 175
                }
            }
        },
        "connections": {
            "tool1D1388756427315_tool2D1388756434803_1388756437081": {
                "source": "tool1D1388756427315",
                "target": "tool2D1388756434803",
                "output": "tool1D1388756427315_genome",
                "input": "tool2D1388756434803_vcf1",
                "id": "tool1D1388756427315_tool2D1388756434803_1388756437081"
            },
            "tool3D1388756430435_tool2D1388756434803_1388756438594": {
                "source": "tool3D1388756430435",
                "target": "tool2D1388756434803",
                "output": "tool3D1388756430435_genome",
                "input": "tool2D1388756434803_vcf",
                "id": "tool3D1388756430435_tool2D1388756434803_1388756438594"
            }
        },
        "signature": {
            "name": "RNA-Seq Alignment for Ion Proton - STAR + Bowtie 2",
            "description": "Align RNA-Seq reads from FASTQ files generated by the Ion Proton. \r\n\r\nThe first step of this pipeline is the adapter clipping step in which adapter sequence from 3p of each mate is removed. Alignment step consists of spliced junction aligner STAR as first alignment step and short read aligner Bowtie 2 as a second. After first alignment step all unaligned reads are separately aligned with Bowtie 2 and results are merged with aligned results of the first.\r\n\r\nThe pipeline accepts only one file per sample (or two files, for paired-end data). If reads for your samples are split, you should use Merge FASTQ Files to consolidate them into one before aligning them. \r\nReference sequences are collected from all specified FASTA files, and optionally splice junctions database which can be in GTF or GFF format. To use the splice junction database it is necessary to set the sjdbOverhang parameter to a value larger than 0. For constant read length this value should ideally be equal to mate length decreased by 1, but in case of long reads with non-constant length this value should be 100 (pipeline default). FastQC Analysis on your FASTQ files enables you to find out distribution of reads length. \r\n\r\nIt also have the ability to detect chimeric transcripts, but it is necessary to adjust parameter chimSegmentMin to a desired minimum chimeric segment length.\r\n\r\nAligned reads are reported in BAM format, ready to view in a genome browser such as IGV. File with detected splice junctions is also produced, and additional metrics is gathered by Picard Alignment Summary Metrics."
        }
    }
}